//SORTJOB  JOB  (ACCT),'SORT TEST',CLASS=A,MSGCLASS=X
//STEP1    EXEC PGM=SORT
//SYSOUT   DD  SYSOUT=*
//SORTIN   DD  DSN=YOUR.INPUT.FILE,DISP=SHR
//SORTOUT  DD  DSN=YOUR.OUTPUT.FILE,
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(TRK,(5,5)),
//             DCB=(RECFM=FB,LRECL=26)
//SYSIN    DD  *
  SORT FIELDS=(1,5,CH,A)
/*
//SYSIN DD *
  SORT FIELDS=COPY
  OUTREC FIELDS=(1,5,6,15,21,6)
/*
//SYSIN DD *
  SORT FIELDS=COPY
  OUTREC BUILD=(1,26,C' OK')
/*
//STEP1 EXEC PGM=ICETOOL
//TOOLMSG DD SYSOUT=*
//DFSMSG  DD SYSOUT=*
//IN      DD DSN=YOUR.INPUT.FILE,DISP=SHR
//TOOLIN  DD *
  COUNT FROM(IN)
/*
SORT FIELDS=(...)
SORT FIELDS=COPY
INCLUDE COND=(21,6,ZD)
OMIT    COND=(1,5,CH,EQ,C'00000')
OUTREC BUILD=(1,5,C' ',6,15)
OUTFIL FNAMES=GOOD,INCLUDE=(21,6,ZD)
OUTFIL FNAMES=BAD,OMIT=(21,6,ZD)
SUM FIELDS=(21,6,ZD)
JOINKEYS FILE=F1,FIELDS=(1,5,A)
JOINKEYS FILE=F2,FIELDS=(1,5,A)
OUTREC IFTHEN=(WHEN=(21,6,ZD),
               BUILD=(1,26,C'GOOD'))
FINDREP IN=C'ABC',OUT=C'XYZ'


