
```markdown
```JCL
//STEP1 EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=INPUT.FILE,DISP=SHR
//SYSUT2   DD DSN=OUTPUT.FILE,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(5,5)),
//            DCB=(RECFM=FB,LRECL=80)
//SYSIN    DD DUMMY
//
//SYSIN DD *
  GENERATE MAXFLDS=1
/*
  RECORD FIELD=(80)
  FIELD FIELD=(1,10,1)
  FIELD FIELD=(1,10,1,10,C'HELLO')
//
//STEP1 EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=INPUT.FILE,DISP=SHR
//SYSUT2   DD DSN=OUTPUT.FILE,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(5,5)),
//            DCB=(RECFM=FB,LRECL=90)
//SYSIN DD *
  GENERATE MAXFLDS=1
  RECORD FIELD=(80)
  FIELD FIELD=(1,80,1,80,C' OK')
/*
