//STEP1 EXEC PGM=IEFBR14
//NEWFILE DD DSN=YOUR.NEW.FILE,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(5,5)),
//            DCB=(RECFM=FB,LRECL=80)

//STEP1 EXEC PGM=IEFBR14
//DELFILE DD DSN=YOUR.FILE,
//            DISP=(OLD,DELETE,DELETE)

//STEP1 EXEC PGM=IEFBR14
//TEMP DD DSN=&&TEMP,
//         DISP=(NEW,PASS),
//         SPACE=(TRK,(1,1))

//STEP2 EXEC PGM=IEFBR14
//NEWGEN DD DSN=YOUR.GDG.BASE(+1),
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(5,5)),
//            DCB=(RECFM=FB,LRECL=80)
